danshawx/stm32g474_demo/stm32g474re_demo/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"
#include "stm32g4xx_ll_dma.h"
#include "stm32g4xx_ll_usart.h"
#include "stm32g4xx_ll_rcc.h"
#include "stm32g4xx_ll_system.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_ll_exti.h"
#include "stm32g4xx_ll_bus.h"
#include "stm32g4xx_ll_cortex.h"
#include "stm32g4xx_ll_utils.h"
#include "stm32g4xx_ll_pwr.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "my_lib.h"
#include "hal_usart.h"
#include "comm_protocol.h"
#include "comm_task.h"

#include "my_task.h"

#include "checksum.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CE_Pin LL_GPIO_PIN_6
#define CE_GPIO_Port GPIOC
#define DWM_IRQ_Pin LL_GPIO_PIN_7
#define DWM_IRQ_GPIO_Port GPIOC
#define DWM_IRQA12_Pin LL_GPIO_PIN_12
#define DWM_IRQA12_GPIO_Port GPIOA
#define DWM_IRQA12_EXTI_IRQn EXTI15_10_IRQn
#define DWM_NSS_Pin LL_GPIO_PIN_15
#define DWM_NSS_GPIO_Port GPIOA
#define DWM_SCK_Pin LL_GPIO_PIN_3
#define DWM_SCK_GPIO_Port GPIOB
#define DWM_MISO_Pin LL_GPIO_PIN_4
#define DWM_MISO_GPIO_Port GPIOB
#define DWM_MOSI_Pin LL_GPIO_PIN_5
#define DWM_MOSI_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
